# TableCellCalculatedValueData Properties

---
The TableCellCalculatedValueData type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
TableCellCalculatedValueData Class
Autodesk.Revit.DB Namespace